
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МолокоЖирность = 3.4;
	ОбратЖирность = 0.05;
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать(Команда)
	
	МолокоЖирностьФ = МолокоЖирность/100;
	ОбратЖирностьФ = ОбратЖирность/100;
	СмесьЖирностьФ = СмесьЖирность/100;
	
	СмесьКоличествоЖира = СмесьКоличество*СмесьЖирностьФ;
	
	ОбратКоличество = (СмесьКоличество*МолокоЖирностьФ-СмесьКоличествоЖира)/(МолокоЖирностьФ-ОбратЖирностьФ);
	
	ОбратКоличествоЖира = ОбратКоличество*ОбратЖирностьФ;
	
	МолокоКоличество = СмесьКоличество - ОбратКоличество;
	
	МолокоКоличествоЖира = МолокоКоличество*МолокоЖирностьФ;
	
КонецПроцедуры
