
Функция СведенияОВнешнейОбработке() Экспорт

    ПараметрыРегистрации = Новый Структура;
    ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка");
    ПараметрыРегистрации.Вставить("Наименование", НСтр("ru = 'Калькулятор количества молока'"));
    ПараметрыРегистрации.Вставить("Версия", "1.0");
    ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
    ПараметрыРегистрации.Вставить("Информация", НСтр("ru = 'Калькулятор количества молока'"));
//    ПараметрыРегистрации.Вставить("ВерсияБСП", "1.2.1.4");

    тз = Новый ТаблицаЗначений;
	тз.Колонки.Добавить("Идентификатор");
	тз.Колонки.Добавить("Использование");
	тз.Колонки.Добавить("Представление");

	НоваяСтрока = тз.Добавить();
	НоваяСтрока.Идентификатор = "ОткрытьОбработку";
	НоваяСтрока.Использование = "ОткрытиеФормы";
	НоваяСтрока.Представление = "Калькулятор количества молока";

	ПараметрыРегистрации.Вставить("Команды", тз);
    Возврат ПараметрыРегистрации;

КонецФункции // СведенияОВнешнейОбработке()
